thamkhanhdev/stm32_apps/H750_SDIO_MATRIX/Src/matrix.c
/*================================================================================================*/
/**
*   @file       matrix.c
*   @author     Khanh Tham
*   @contact    thamkhanhdev@gmail.com
*   @version    1.0.0
*
*   @brief      Matrix program body.
*   @details    This is a demo application showing the usage of the API.
*
*   This file contains sample code only. It is not part of the production code deliverables.
*
*   @addtogroup BUILD_ENV_COMPONENT
*   @{
*/
/*==================================================================================================
*   Project              : Full color - Rgb matrix pannel
*   Platform             : STM32H750xxx
*
*   SW Version           : 1.0.0
*   Build Version        : Reserved
*
*   Copyright 2020 ST Semiconductor, Inc.
*   All Rights Reserved.
==================================================================================================*/
#ifdef __cplusplus
extern "C"{
#endif

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "matrix.h"
#include "gamma.h"
#include "gfxfont.h"
#include "TomThumb.h"
#include "stm32h7xx.h"

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/


/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/


/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/

// static uint16_t const gTimeCount[8]={10, 20, 40, 80, 160, 240, 320}; // he so chia nap vao timer ok with 256x64 47.9Hz
// static uint16_t const gTimeCount[8]={15, 30, 60, 120, 160, 240, 320}; // he so chia nap vao timer ok with 256x64 47.9Hz
// uint16_t const gTimeCount[8]={ 70, 70, 70, 70, 70, 70, 70, 70}; // he so chia nap vao timer ok with 256x64 47.9Hz
uint16_t const gTimeCount[8]={ 30, 50, 90, 160, 240, 320, 480, 600}; // he so chia nap vao timer ok with 256x64 47.9Hz
// uint16_t const gTimeCount[8]={ 33, 60, 110, 180, 250, 320, 480, 600}; // he so chia nap vao timer ok with 256x64 47.9Hz
// uint16_t const gTimeCount[8]={ 40, 80, 160, 240, 360, 480, 600, 1000}; // he so chia nap vao timer ok with 256x64 47.9Hz
// uint16_t const gTimeCount[8]={ 160, 240, 360, 480, 600, 1000, 1500}; // he so chia nap vao timer ok with 256x64 47.9Hz

static const int8_t sinetab[256] = {
     0,   2,   5,   8,  11,  15,  18,  21,
    24,  27,  30,  33,  36,  39,  42,  45,
    48,  51,  54,  56,  59,  62,  65,  67,
    70,  72,  75,  77,  80,  82,  85,  87,
    89,  91,  93,  96,  98, 100, 101, 103,
   105, 107, 108, 110, 111, 113, 114, 116,
   117, 118, 119, 120, 121, 122, 123, 123,
   124, 125, 125, 126, 126, 126, 126, 126,
   127, 126, 126, 126, 126, 126, 125, 125,
   124, 123, 123, 122, 121, 120, 119, 118,
   117, 116, 114, 113, 111, 110, 108, 107,
   105, 103, 101, 100,  98,  96,  93,  91,
    89,  87,  85,  82,  80,  77,  75,  72,
    70,  67,  65,  62,  59,  56,  54,  51,
    48,  45,  42,  39,  36,  33,  30,  27,
    24,  21,  18,  15,  11,   8,   5,   2,
     0,  -3,  -6,  -9, -12, -16, -19, -22,
   -25, -28, -31, -34, -37, -40, -43, -46,
   -49, -52, -55, -57, -60, -63, -66, -68,
   -71, -73, -76, -78, -81, -83, -86, -88,
   -90, -92, -94, -97, -99,-101,-102,-104,
  -106,-108,-109,-111,-112,-114,-115,-117,
  -118,-119,-120,-121,-122,-123,-124,-124,
  -125,-126,-126,-127,-127,-127,-127,-127,
  -128,-127,-127,-127,-127,-127,-126,-126,
  -125,-124,-124,-123,-122,-121,-120,-119,
  -118,-117,-115,-114,-112,-111,-109,-108,
  -106,-104,-102,-101, -99, -97, -94, -92,
   -90, -88, -86, -83, -81, -78, -76, -73,
   -71, -68, -66, -63, -60, -57, -55, -52,
   -49, -46, -43, -40, -37, -34, -31, -28,
   -25, -22, -19, -16, -12,  -9,  -6,  -3
};

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/
/**
 * @brief Number of multiplexed rows; actual MATRIX_HEIGHT is 2X this.
 */
static uint8_t gRows = 0;

/**
 * @brief The actual postion bit is handling.
 */
static uint8_t gBitPos = 0U;

/**
 * @brief The current brightness value
 */
static uint8_t gBrightness;
static bool gCp437 = false;
static volatile uint32_t gCountBit = 0UL;
uint16_t gBuff[MATRIX_WIDTH*MATRIX_HEIGHT*MAX_BIT/2];
static uint16_t gCursorX = 0U;
static uint16_t gBackupX = 0U;
static uint16_t gCursorY = 0U;
static uint16_t gBackupY = 0U;
static uint8_t  gTextSizeX = 1U;
static uint8_t  gTextSizeY = 1U;
static uint16_t gTextColor = 0xFFFFU;
static uint16_t gTextBgColor = 0xFFFFU;
static const GFXfont *gfxFont = &TomThumb;       ///< Pointer to special font
// static const GFXfont *gfxFont = NULL;       ///< Pointer to special font
/*==================================================================================================
*                                      GLOBAL CONSTANTS
==================================================================================================*/


/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/
/**
  * @brief The array store image data.
  */
extern const uint8_t gImage_test[];

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/
/**
 * The C library function int vsprintf(char *str, const char *format, va_list arg)
 * sends formatted output to a string using an argument list passed to it.
 */
int vsprintf(char *str, const char *format, va_list arg);

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
static inline uint8_t * pgm_read_bitmap_ptr( const GFXfont *gfxFont )
{
    return (uint8_t *) pgm_read_pointer( &gfxFont->bitmap );
}

static inline GFXglyph * pgm_read_glyph_ptr(const GFXfont *gfxFont, uint8_t c)
{
    return &(((GFXglyph *)pgm_read_pointer(&gfxFont->glyph))[c]);
}

inline static void MATRIX_Vprint( MATRIX_FontTypes fontType, const char *fmt, va_list argp )
{
    char string[200];
    if(0 < vsprintf(string,fmt,argp)) // build string
    {
        MATRIX_Print( (uint8_t *) string, fontType);
    }
}
/**
 * @brief   Write a pixel, overwrite in subclasses if startWrite is defined!
 * @details
 *          Write a pixel, overwrite in subclasses if startWrite is defined,
 *          For example scan with 5bit per color per pixel
 *          For each | w | instance, they store MATRIX_HEIGHT pixels.
 *          |  w |  w |  w |  w |  w |  w |  w |  w |  w |  w |  w |  w |  w |  w |  w |
 *          | b0 | b1 | b2 | b3 | b4 | b0 | b1 | b2 | b3 | b4 | b0 | b1 | b2 | b3 | b4 |
 *          |---------- r0 ----------|---------- r1 ----------|---------- r2 ----------|
 *          Total elements are MATRIX_WIDTH * MATRIX_HEIGHT * MAX_BIT. Actual only need to scan a half
 *          part of one matrix.
 *
 * @param   x   x coordinate
 * @param   y   y coordinate
 * @param   color 16-bit 5-6-5 Color to fill with
 *
 * @retval  StdReturnType
 *          E_OK: Write a pexel successfully.
 *          E_NOT_OK Otherwise.
 */
 static inline void MATRIX_DrawPixel( uint16_t x, uint16_t y, uint32_t c )
{
    uint32_t _curPos;
    uint8_t r, g, b;
    uint16_t bit, limit;

#if defined(RGB888)
    r = (c >> 16) & 0xFF; /* RRRRRRRRggggggggbbbbbbbb */
    g = (c >>  8) & 0xFF; /* rrrrrrrrGGGGGGGGbbbbbbbb */
    b = (c >>  0) & 0xFF; /* rrrrrrrrggggggggBBBBBBBB */
#elif defined(RGB666)
    r =  c >> 12;         /* RRRRRRggggggbbbbbb */
    g = (c >>  6) & 0x3F; /* rrrrrrGGGGGGbbbbbb */
    b = (c >>  0) & 0x3F; /* rrrrrrggggggBBBBBB */
#elif defined(RGB565)
    r =  c >> 11;         /* RRRRRggggggbbbbb */
    g = (c >>  6) & 0x1F; /* rrrrrGGGGGGbbbbb */
    b = (c >>  0) & 0x1F; /* rrrrrggggggBBBBB */
#elif defined(RGB555)
    r =  c >> 10;         /* RRRRRgggggbbbbb */
    g = (c >>  5) & 0x1F; /* rrrrrGGGGGbbbbb */
    b = (c >>  0) & 0x1F; /* rrrrrgggggBBBBB */
#elif defined(RGB444)
    r = (c >>  8) & 0xF;  /* RRRRggggbbbb */
    g = (c >>  4) & 0xF;  /* rrrrGGGGbbbb */
    b = (c >>  0) & 0xF;  /* rrrrggggBBBB */
#elif defined(RGB333)
#endif

    bit   = 1;
    limit = 1 << MAX_BIT;

    /* Fill data to the second bus if used */
#ifdef USE2BUS
    if( y >= MATRIX_HEIGHT/2 )
    {
        /* Minus by MATRIX_HEIGHT/2 */
        y = y - MATRIX_HEIGHT/2 ;

        if( y < MATRIX_SCANRATE )
        {
            /**
             * Data for the upper half of the display is stored in the lower
             * bits of each byte.
             */
            /* Base address of current position of the pixel */
            _curPos = y * MATRIX_WIDTH * MAX_BIT + x;

            /**
             * The remaining three image planes are more normal-ish.
             * Data is stored in the high 6 bits so it can be quickly
             * copied to the DATAPORT register w/6 output lines.
             */
            while( bit < limit )
            {
                gBuff[_curPos] &= ~RGB3_MASK;                   /* 00000111b Mask out R,G,B in one op */
                if( r & bit ) gBuff[_curPos] |= R3_MASK;     /* Plane N R: bit 6 0000.0100.0000b     */
                if( g & bit ) gBuff[_curPos] |= G3_MASK;     /* Plane N G: bit 7 0000.1000.0000b     */
                if( b & bit ) gBuff[_curPos] |= B3_MASK;    /* Plane N B: bit 8 0001.0000.0000b     */
                _curPos  += MATRIX_WIDTH;                /* Advance to next bit plane */
                bit <<= 1 ;
            }
        }
        else
        {
            /* Data for the lower half of the display is stored in the upper bits */
            _curPos = (y - MATRIX_SCANRATE) * MATRIX_WIDTH * MAX_BIT + x;

