thamkhanhdev/stm32_apps/H750_SDIO_MATRIX/Src/matrix.c
            while( bit < limit )
            {
                gBuff[_curPos] &= ~RGB4_MASK;              /* 00111000b Mask out R,G,B in one op */
                if(r & bit) gBuff[_curPos] |= R4_MASK;    /* Plane N R: bit 11 1000.0000.0000b    */
                if(g & bit) gBuff[_curPos] |= G4_MASK;   /* Plane N G: bit 9  0010.0000.0000b    */
                if(b & bit) gBuff[_curPos] |= B4_MASK;   /* Plane N B: bit 10 0100.0000.0000b    */
                _curPos  += MATRIX_WIDTH;             /* Advance to next bit plane */
                bit <<= 1 ;
            }
        }
    }
    else
#endif /* USE2BUS */
    /* Fill data to the first bus at default mode */
    if( y < MATRIX_SCANRATE)
    {
        /**
         * Data for the upper half of the display is stored in the lower
         * bits of each byte.
         */
        /* Base address of current position of the pixel */
        _curPos = y * MATRIX_WIDTH * MAX_BIT + x;

        /**
         * The remaining three image planes are more normal-ish.
         * Data is stored in the high 6 bits so it can be quickly
         * copied to the DATAPORT register w/6 output lines.
         */
        while( bit < limit )
        {
           gBuff[_curPos] &= ~RGB1_MASK;                   /* 00000111b Mask out R,G,B in one op */
           if( r & bit ) gBuff[_curPos] |= R1_MASK;     /* Plane N R: bit 6 0000.0100.0000b     */
           if( g & bit ) gBuff[_curPos] |= G1_MASK;     /* Plane N G: bit 7 0000.1000.0000b     */
           if( b & bit ) gBuff[_curPos] |= B1_MASK;    /* Plane N B: bit 8 0001.0000.0000b     */
            _curPos  += MATRIX_WIDTH;                /* Advance to next bit plane */
            bit <<= 1 ;
        }
    }
   else
   {
       /* Data for the lower half of the display is stored in the upper bits */
       _curPos = (y - MATRIX_SCANRATE) * MATRIX_WIDTH * MAX_BIT + x;

       while( bit < limit )
       {
           gBuff[_curPos] &= ~RGB2_MASK;              /* 00111000b Mask out R,G,B in one op */
           if(r & bit) gBuff[_curPos] |= R2_MASK;    /* Plane N R: bit 11 1000.0000.0000b    */
           if(g & bit) gBuff[_curPos] |= G2_MASK;   /* Plane N G: bit 9  0010.0000.0000b    */
           if(b & bit) gBuff[_curPos] |= B2_MASK;   /* Plane N B: bit 10 0100.0000.0000b    */
           _curPos  += MATRIX_WIDTH;             /* Advance to next bit plane */
           bit <<= 1 ;
       }
   }
}

static inline uint16_t MATRIX_Color888( uint8_t r, uint8_t g, uint8_t b, bool gflag )
{
    if( gflag )
    { // Gamma-corrected color?
        r = pgm_read_byte(&gamma_table[r]); // Gamma correction table maps
        g = pgm_read_byte(&gamma_table[g]); // 8-bit input to 4-bit output
        b = pgm_read_byte(&gamma_table[b]);
        return  ((uint16_t)r << 12) | ((uint16_t)(r & 0x8) << 8) | // 4/4/4->5/6/5
                ((uint16_t)g <<  7) | ((uint16_t)(g & 0xC) << 3) |
                (          b <<  1) | (           b        >> 3);
    } // else linear (uncorrected) color
    return ((uint16_t)(r & 0xF8) << 8) | ((uint16_t)(g & 0xFC) << 3) | (b >> 3);
}

/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
/**
  * @brief  None.
  *
  * @param  None.
  * @retval None.
  */
StdReturnType MATRIX_Init( uint8_t bri )
{
    gBrightness = bri;

    return E_OK;
}

/**
  * @brief  Resfresh function for active display.
  *
  * @param  None.
  * @retval None.
  */
void IRQ_ProcessMonitor( void )
{
    uint16_t u16Count = MATRIX_WIDTH;

    /* Load new division value */
    TIM_DAT->PSC = gTimeCount[gBitPos];
    /* Trigger EGR upto 1 in order re-load PSC value */
    TIM_DAT->EGR = 1U;
    /* Clear interrupt flag */
    TIM_DAT->SR = 0xFFFFFFFE;

    /* Latch data loaded during *prior* interrupt */
    LAT_P->BSRR=LAT_BIT_SET;
    /* Disable LED output during gRows/gBitPos switchover */
    TIM_OE->CCR2 = 0U;

    /* Release new data region */
    while( u16Count-- )
    {
        CLK_P->BSRR=CLK_BIT_RESET;
        DAT_P->ODR= gBuff[ gCountBit++ ];
        CLK_P->BSRR=CLK_BIT_SET;
    }

    TIM_OE->CCR2 = gBrightness;
    LAT_P->BSRR = LAT_BIT_RESET;
    ROW_P->ODR = gRows;

    if( ++gBitPos >= MAX_BIT )
    {
        gBitPos = 0U;
        if( ++gRows >= MATRIX_SCANRATE )
        {
            gCountBit = 0U;
            gRows = 0U;
        }
    }
}

/**
  * @brief  None.
  *
  * @param  None.
  * @retval None.
  */
uint8_t MATRIX_getBrightness( void )
{
    return gBrightness;
}

/**
  * @brief  None.
  *
  * @param  None.
  * @retval None.
  */
StdReturnType MATRIX_setBrightness( uint8_t bri )
{
    gBrightness = bri;
    return E_OK;
}

inline void MATRIX_SwapBuffers( void )
{
    (void) 1U;
#ifdef USE_DOUBLE_BUFF
    gSwapFlag = true;
    while(gSwapFlag == true);
#endif
}

/**
  * @brief  None.
  *
  * @param  None.
  * @retval None.
  */
StdReturnType MATRIX_disImage( const uint8_t arr[], uint16_t nCols, uint16_t nRows)
{
    uint32_t p1;
    uint32_t c = 0;
    uint16_t row, col;
    uint8_t  r, g, b;

    for( row = 0; row < nRows; row++)
    {
        for( col = 0; col < nCols; col++)
        {
            p1 = row * nCols*3;
#if   defined(RGB888) || defined(RGB666)
            /**
             * In the case use RGB888 format, we didnt want to down quality
             * of the pixels.
             */
            r = arr[p1+col*3+2];
            g = arr[p1+col*3+1];
            b = arr[p1+col*3+0];

#elif defined(RGB565) || defined(RGB555) || defined(RGB444)
            r = pgm_read_byte(&gamma_table[(arr[p1+col*3+2] * 255) >> 8 ]);
            g = pgm_read_byte(&gamma_table[(arr[p1+col*3+1] * 255) >> 8 ]);
            b = pgm_read_byte(&gamma_table[(arr[p1+col*3+0] * 255) >> 8 ]);
#endif

#if   defined(RGB888)
            c = ((r << 16) & 0xFF0000) |
                ((g <<  8) & 0x00FF00) |
                ((b <<  0) & 0x0000FF);
#elif defined(RGB666)
            c = ((r << 10) & 0x3F000) |
                ((g <<  4) & 0x00FC0) |
                ((b >>  2) & 0x0003F);
#elif defined(RGB565)
            c = (r << 12) | ((r & 0x8) << 8) | // 4/4/4 -> 5/6/5
                (g <<  7) | ((g & 0xC) << 3) |
                (b <<  1) | ( b        >> 3);
#elif defined(RGB555)
            c = (r << 11) | ((r & 0x8) << 7) | // 4/4/4 -> 5/5/5
                (g <<  6) | ((g & 0x8) << 2) |
                (b <<  1) | ( b        >> 3);
#elif defined(RGB444)
            c = ((r << 8)&0xF00) |
                ((g << 4)&0x0F0) |
                ((b << 0)&0x00F);
#elif defined(RGB333)
#endif  /* defined(RGBxxx) */

            /* RGB565 rrrrrggggggbbbbb */
            // c = ((c>>8)&0xF800) | ((c>>5)&0x07E0) | ((c>>3)&0x1F);
            MATRIX_DrawPixel( col, row, c );
        }
    }
    MATRIX_SwapBuffers();
    return E_OK;
}

void MATRIX_WritePixel( uint16_t x, uint16_t y, uint32_t c )
{
    MATRIX_DrawPixel( x, y, c );
}

StdReturnType MATRIX_FillAllColorPannel( uint8_t cR, uint8_t cG, uint8_t cB )
{
    uint16_t y = 0, x = 0;
    uint32_t u32Color = 0UL;
#if defined(RGB666)
    /* Convert RGB888 to RGB666 */
    u32Color = ((cR << 10)&0x3F000) | ((cG<<4)&0xFB0) | ((cB>>2)&0x3F);
#elif defined(RGB565)
    /* Convert RGB888 to RGB565 */
    u32Color = ((cR << 8)&0xF800) | ((cG<<3)&0x07E0) | ((cB>>3)&0x1F);
#elif defined(RGB555)
    /* Convert RGB888 to RGB555 */
    u32Color = ((cR << 7)&0x3E00) | ((cG<<2)&0x03E0) | ((cB>>3)&0x1F);
#endif

    GPIOD->BSRR = (1<<29);
    for( y = 0U; y < MATRIX_HEIGHT; y++ )
    {
        for( x = 0U; x < MATRIX_WIDTH; x++ )
        {
            MATRIX_DrawPixel( x, y, u32Color );
        }
    }
    GPIOD->BSRR = (1<<13);
    MATRIX_SwapBuffers();
    return E_OK;
}

uint16_t ColorHSV( uint16_t x, uint16_t y, long hue, uint8_t sat, uint8_t val, char gflag)
{
  uint8_t  r, g, b, lo;
  uint16_t s1, v1;

  // Hue
  hue %= 1536;             // -1535 to +1535
  if(hue < 0) hue += 1536; //     0 to +1535
  lo = hue & 255;          // Low byte  = primary/secondary color mix
  switch(hue >> 8) {       // High byte = sextant of colorwheel
    case 0 : r = 255     ; g =  lo     ; b =   0     ; break; // R to Y
    case 1 : r = 255 - lo; g = 255     ; b =   0     ; break; // Y to G
    case 2 : r =   0     ; g = 255     ; b =  lo     ; break; // G to C
    case 3 : r =   0     ; g = 255 - lo; b = 255     ; break; // C to B
    case 4 : r =  lo     ; g =   0     ; b = 255     ; break; // B to M
    default: r = 255     ; g =   0     ; b = 255 - lo; break; // M to R
  }

  // Saturation: add 1 so range is 1 to 256, allowig a quick shift operation
  // on the result rather than a costly divide, while the type upgrade to int
  // avoids repeated type conversions in both directions.
  s1 = sat + 1;
  r  = 255 - (((255 - r) * s1) >> 8);
  g  = 255 - (((255 - g) * s1) >> 8);
  b  = 255 - (((255 - b) * s1) >> 8);

