thamkhanhdev/stm32_apps/H750_SDIO_MATRIX/Src/matrix.c
  // Value (brightness) & 16-bit color reduction: similar to above, add 1
  // to allow shifts, and upgrade to int makes other conversions implicit.
  v1 = val + 1;
  if(gflag) { // Gamma-corrected color?
    r = pgm_read_byte(&gamma_table[(r * v1) >> 8]); // Gamma correction table maps
    g = pgm_read_byte(&gamma_table[(g * v1) >> 8]); // 8-bit input to 4-bit output
    b = pgm_read_byte(&gamma_table[(b * v1) >> 8]);
  } else { // linear (uncorrected) color
    r = (r * v1) >> 12; // 4-bit results
    g = (g * v1) >> 12;
    b = (b * v1) >> 12;
  }
    // rgb = ((r & 0b11111000) << 8) | ((g & 0b11111100) << 3) | (b >> 3);
  return (r << 12) | ((r & 0x8) << 8) | // 4/4/4 -> 5/6/5
         (g <<  7) | ((g & 0xC) << 3) |
         (b <<  1) | ( b        >> 3);
}

void plasma( void )
{
    int           x1, x2, x3, x4, y1, y2, y3, y4, sx1, sx2, sx3, sx4;
    unsigned int x, y;
    long          value;
const float radius1 =16.3, radius2 =23.0, radius3 =40.8, radius4 =44.2,
            centerx1=16.1, centerx2=11.6, centerx3=23.4, centerx4= 4.1,
            centery1= 8.7, centery2= 6.5, centery3=14.0, centery4=-2.9;
double       angle1  = 0.0, angle2  = 0.0, angle3  = 0.0, angle4  = 0.0;
long        hueShift= 0;
    /* while (1) */
    {
        /* LL_mDelay(100);
        GPIOD->BSRR = (1<<29); */
        sx1 = (int)(cos(angle1) * radius1 + centerx1);
        sx2 = (int)(cos(angle2) * radius2 + centerx2);
        sx3 = (int)(cos(angle3) * radius3 + centerx3);
        sx4 = (int)(cos(angle4) * radius4 + centerx4);
        y1  = (int)(sin(angle1) * radius1 + centery1);
        y2  = (int)(sin(angle2) * radius2 + centery2);
        y3  = (int)(sin(angle3) * radius3 + centery3);
        y4  = (int)(sin(angle4) * radius4 + centery4);

        for(y=0; y<MATRIX_HEIGHT; y++)
        {
            x1 = sx1; x2 = sx2; x3 = sx3; x4 = sx4;
            for(x=0; x<MATRIX_WIDTH; x++)
            {
                value = hueShift
                    + (int8_t)pgm_read_byte(sinetab + (uint8_t)((x1 * x1 + y1 * y1) >> 5))
                    + (int8_t)pgm_read_byte(sinetab + (uint8_t)((x2 * x2 + y2 * y2) >> 5))
                    + (int8_t)pgm_read_byte(sinetab + (uint8_t)((x3 * x3 + y3 * y3) >> 6))
                    + (int8_t)pgm_read_byte(sinetab + (uint8_t)((x4 * x4 + y4 * y4) >> 6));
                    MATRIX_DrawPixel(x, y, ColorHSV(x, y, value * 3, 255, 255, 1) );
                    // matrix.drawPixel(x, y, ColorHSV(value * 3, 255, 255, 1));
                x1--; x2--; x3--; x4--;
            }
        y1--; y2--; y3--; y4--;
        }

        MATRIX_SwapBuffers();
        /* GPIOD->BSRR = (1<<13); */
        angle1 += 0.03;
        angle2 -= 0.07;
        angle3 += 0.13;
        angle4 -= 0.15;
        hueShift += 2;
        /* while(1); */
    }
}
/**
 *
 *  @brief    Draw a circle outline
 *
 *  @param    x0   Center-point x coordinate
 *  @param    y0   Center-point y coordinate
 *  @param    r   Radius of circle
 *  @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_DrawCircle( int16_t x0, int16_t y0, int16_t r, uint16_t color)
{
    int16_t f = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -2 * r;
    int16_t x = 0;
    int16_t y = r;

    MATRIX_DrawPixel(x0  , y0+r, color);
    MATRIX_DrawPixel(x0  , y0-r, color);
    MATRIX_DrawPixel(x0+r, y0  , color);
    MATRIX_DrawPixel(x0-r, y0  , color);

    while (x<y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        MATRIX_DrawPixel(x0 + x, y0 + y, color);
        MATRIX_DrawPixel(x0 - x, y0 + y, color);
        MATRIX_DrawPixel(x0 + x, y0 - y, color);
        MATRIX_DrawPixel(x0 - x, y0 - y, color);
        MATRIX_DrawPixel(x0 + y, y0 + x, color);
        MATRIX_DrawPixel(x0 - y, y0 + x, color);
        MATRIX_DrawPixel(x0 + y, y0 - x, color);
        MATRIX_DrawPixel(x0 - y, y0 - x, color);
    }
}

/**
 *   @brief    Write a line.  Bresenham's algorithm - thx wikpedia
 *
 *   @param    x0  Start point x coordinate
 *   @param    y0  Start point y coordinate
 *   @param    x1  End point x coordinate
 *   @param    y1  End point y coordinate
 *   @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_WriteLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color)
{
    int16_t steep = abs(y1 - y0) > abs(x1 - x0);

    if (steep) {
        _swap_int16_t(x0, y0);
        _swap_int16_t(x1, y1);
    }

    if (x0 > x1) {
        _swap_int16_t(x0, x1);
        _swap_int16_t(y0, y1);
    }

    int16_t dx, dy;
    dx = x1 - x0;
    dy = abs(y1 - y0);

    int16_t err = dx / 2;
    int16_t ystep;

    if (y0 < y1) {
        ystep = 1;
    } else {
        ystep = -1;
    }

    for (; x0<=x1; x0++) {
        if (steep) {
            MATRIX_DrawPixel(y0, x0, color);
        } else {
            MATRIX_DrawPixel(x0, y0, color);
        }
        err -= dy;
        if (err < 0) {
            y0 += ystep;
            err += dx;
        }
    }
}

/**
 *   @brief    Draw a perfectly vertical line (this is often optimized in a subclass!)
 *
 *   @param    x   Top-most x coordinate
 *   @param    y   Top-most y coordinate
 *   @param    h   Height in pixels
 *   @param    color 16-bit 5-6-5 Color to fill with
 */
void MATRIX_DrawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color)
{
    MATRIX_WriteLine(x, y, x, y+h-1, color);
}

/**
 *   @brief    Draw a perfectly horizontal line (this is often optimized in a subclass!)
 *
 *   @param    x   Left-most x coordinate
 *   @param    y   Left-most y coordinate
 *   @param    w   Width in pixels
 *   @param    color 16-bit 5-6-5 Color to fill with
 */
void MATRIX_DrawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color)
{
    MATRIX_WriteLine(x, y, x+w-1, y, color);
}

/*!
 *  @brief    Fill a rectangle completely with one color. Update in subclasses if desired!
 *
 *  @param    x   Top left corner x coordinate
 *  @param    y   Top left corner y coordinate
 *  @param    w   Width in pixels
 *  @param    h   Height in pixels
 *  @param    color 16-bit 5-6-5 Color to fill with
*/
void MATRIX_FillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
    for( int16_t i=x; i<x+w; i++)
    {
        MATRIX_DrawFastVLine(i, y, h, color);
    }
}

/**
 *  @brief    Fill the screen completely with one color. Update in subclasses if desired!
 *
 *  @param    color 16-bit 5-6-5 Color to fill with
 */
void MATRIX_FillScreen(uint16_t color)
{
    MATRIX_FillRect(0, 0, MATRIX_WIDTH, MATRIX_HEIGHT, color);
}

/**
 *  @brief    Draw a line
 *  @param    x0  Start point x coordinate
 *  @param    y0  Start point y coordinate
 *  @param    x1  End point x coordinate
 *  @param    y1  End point y coordinate
 *  @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_DrawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color)
{
    // Update in subclasses if desired!
    if(x0 == x1){
        if(y0 > y1) _swap_int16_t(y0, y1);
        MATRIX_DrawFastVLine(x0, y0, y1 - y0 + 1, color);
    } else if(y0 == y1){
        if(x0 > x1) _swap_int16_t(x0, x1);
        MATRIX_DrawFastHLine(x0, y0, x1 - x0 + 1, color);
    } else {
        MATRIX_WriteLine(x0, y0, x1, y1, color);
    }
}

/**
 *  @brief    Quarter-circle drawer, used to do circles and roundrects
 *
 *  @param    x0   Center-point x coordinate
 *  @param    y0   Center-point y coordinate
 *  @param    r   Radius of circle
 *  @param    cornername  Mask bit #1 or bit #2 to indicate which quarters of the circle we're doing
 *  @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_DrawCircleHelper( int16_t x0, int16_t y0, int16_t r, uint8_t cornername, uint16_t color)
{
    int16_t f     = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -2 * r;
    int16_t x     = 0;
    int16_t y     = r;

    while (x<y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f     += ddF_y;
        }
        x++;
        ddF_x += 2;
        f     += ddF_x;
        if (cornername & 0x4) {
            MATRIX_DrawPixel(x0 + x, y0 + y, color);
            MATRIX_DrawPixel(x0 + y, y0 + x, color);
        }
        if (cornername & 0x2) {
            MATRIX_DrawPixel(x0 + x, y0 - y, color);
            MATRIX_DrawPixel(x0 + y, y0 - x, color);
        }
        if (cornername & 0x8) {
            MATRIX_DrawPixel(x0 - y, y0 + x, color);
            MATRIX_DrawPixel(x0 - x, y0 + y, color);
        }
        if (cornername & 0x1) {
            MATRIX_DrawPixel(x0 - y, y0 - x, color);
            MATRIX_DrawPixel(x0 - x, y0 - y, color);
        }
    }
}

/**
 *  @brief    Draw a circle with filled color
 *
 *  @param    x0   Center-point x coordinate
 *  @param    y0   Center-point y coordinate
 *  @param    r   Radius of circle
 *  @param    color 16-bit 5-6-5 Color to fill with
 */
void MATRIX_FillCircle( int16_t x0, int16_t y0, int16_t r, uint16_t color )
{
    MATRIX_DrawFastVLine(x0, y0-r, 2*r+1, color);
    MATRIX_FillCircleHelper(x0, y0, r, 3, 0, color);
}

/**
 *  @brief  Quarter-circle drawer with fill, used for circles and roundrects
 *
 *  @param  x0       Center-point x coordinate
 *  @param  y0       Center-point y coordinate
 *  @param  r        Radius of circle
 *  @param  corners  Mask bits indicating which quarters we're doing
 *  @param  delta    Offset from center-point, used for round-rects
 *  @param  color    16-bit 5-6-5 Color to fill with
 */
void MATRIX_FillCircleHelper( int16_t x0, int16_t y0, int16_t r, uint8_t corners, int16_t delta, uint16_t color )
{
    int16_t f     = 1 - r;
    int16_t ddF_x = 1;
    int16_t ddF_y = -2 * r;
    int16_t x     = 0;
    int16_t y     = r;
    int16_t px    = x;
    int16_t py    = y;

    delta++; // Avoid some +1's in the loop

