thamkhanhdev/stm32_apps/H750_SDIO_MATRIX/Src/matrix.c
    while(x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f     += ddF_y;
        }
        x++;
        ddF_x += 2;
        f     += ddF_x;
        // These checks avoid double-drawing certain lines, important
        // for the SSD1306 library which has an INVERT drawing mode.
        if(x < (y + 1)) {
            if(corners & 1) MATRIX_DrawFastVLine(x0+x, y0-y, 2*y+delta, color);
            if(corners & 2) MATRIX_DrawFastVLine(x0-x, y0-y, 2*y+delta, color);
        }
        if(y != py) {
            if(corners & 1) MATRIX_DrawFastVLine(x0+py, y0-px, 2*px+delta, color);
            if(corners & 2) MATRIX_DrawFastVLine(x0-py, y0-px, 2*px+delta, color);
            py = y;
        }
        px = x;
    }
}

/**
 *  @brief   Draw a rectangle with no fill color
 *
 *  @param    x   Top left corner x coordinate
 *  @param    y   Top left corner y coordinate
 *  @param    w   Width in pixels
 *  @param    h   Height in pixels
 *  @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_DrawRect( int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color )
{
    MATRIX_DrawFastHLine(x, y, w, color);
    MATRIX_DrawFastHLine(x, y+h-1, w, color);
    MATRIX_DrawFastVLine(x, y, h, color);
    MATRIX_DrawFastVLine(x+w-1, y, h, color);
}

/**
 *  @brief   Draw a rounded rectangle with no fill color
 *
 *  @param    x   Top left corner x coordinate
 *  @param    y   Top left corner y coordinate
 *  @param    w   Width in pixels
 *  @param    h   Height in pixels
 *  @param    r   Radius of corner rounding
 *  @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_DrawRoundRect( int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, uint16_t color )
{
    int16_t max_radius = ((w < h) ? w : h) / 2; // 1/2 minor axis
    if(r > max_radius) r = max_radius;
    // smarter version
    MATRIX_DrawFastHLine(x+r  , y    , w-2*r, color); // Top
    MATRIX_DrawFastHLine(x+r  , y+h-1, w-2*r, color); // Bottom
    MATRIX_DrawFastVLine(x    , y+r  , h-2*r, color); // Left
    MATRIX_DrawFastVLine(x+w-1, y+r  , h-2*r, color); // Right
    // draw four corners
    MATRIX_DrawCircleHelper(x+r    , y+r    , r, 1, color);
    MATRIX_DrawCircleHelper(x+w-r-1, y+r    , r, 2, color);
    MATRIX_DrawCircleHelper(x+w-r-1, y+h-r-1, r, 4, color);
    MATRIX_DrawCircleHelper(x+r    , y+h-r-1, r, 8, color);
}

/**
 *  @brief   Draw a rounded rectangle with fill color
 *
 *  @param    x   Top left corner x coordinate
 *  @param    y   Top left corner y coordinate
 *  @param    w   Width in pixels
 *  @param    h   Height in pixels
 *  @param    r   Radius of corner rounding
 *  @param    color 16-bit 5-6-5 Color to draw/fill with
 */
void MATRIX_FillRoundRect( int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, uint16_t color )
{
    int16_t max_radius = ((w < h) ? w : h) / 2; // 1/2 minor axis
    if(r > max_radius) r = max_radius;
    // smarter version
    MATRIX_FillRect(x+r, y, w-2*r, h, color);
    // draw four corners
    MATRIX_FillCircleHelper(x+w-r-1, y+r, r, 1, h-2*r-1, color);
    MATRIX_FillCircleHelper(x+r    , y+r, r, 2, h-2*r-1, color);
}

/**
 *  @brief   Draw a triangle with no fill color
 *
 *  @param    x0  Vertex #0 x coordinate
 *  @param    y0  Vertex #0 y coordinate
 *  @param    x1  Vertex #1 x coordinate
 *  @param    y1  Vertex #1 y coordinate
 *  @param    x2  Vertex #2 x coordinate
 *  @param    y2  Vertex #2 y coordinate
 *  @param    color 16-bit 5-6-5 Color to draw with
 */
void MATRIX_DrawTriangle( int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color )
{
    MATRIX_DrawLine(x0, y0, x1, y1, color);
    MATRIX_DrawLine(x1, y1, x2, y2, color);
    MATRIX_DrawLine(x2, y2, x0, y0, color);
}

/**
 *   @brief     Draw a triangle with color-fill
 *
 *   @param    x0  Vertex #0 x coordinate
 *   @param    y0  Vertex #0 y coordinate
 *   @param    x1  Vertex #1 x coordinate
 *   @param    y1  Vertex #1 y coordinate
 *   @param    x2  Vertex #2 x coordinate
 *   @param    y2  Vertex #2 y coordinate
 *   @param    color 16-bit 5-6-5 Color to fill/draw with
 */
void MATRIX_FillTriangle( int16_t x0, int16_t y0, int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color )
{

    int16_t a, b, y, last;

    // Sort coordinates by Y order (y2 >= y1 >= y0)
    if (y0 > y1) {
        _swap_int16_t(y0, y1); _swap_int16_t(x0, x1);
    }
    if (y1 > y2) {
        _swap_int16_t(y2, y1); _swap_int16_t(x2, x1);
    }
    if (y0 > y1) {
        _swap_int16_t(y0, y1); _swap_int16_t(x0, x1);
    }

    if(y0 == y2) { // Handle awkward all-on-same-line case as its own thing
        a = b = x0;
        if(x1 < a)      a = x1;
        else if(x1 > b) b = x1;
        if(x2 < a)      a = x2;
        else if(x2 > b) b = x2;
        MATRIX_DrawFastHLine(a, y0, b-a+1, color);
        return;
    }

    int16_t
    dx01 = x1 - x0,
    dy01 = y1 - y0,
    dx02 = x2 - x0,
    dy02 = y2 - y0,
    dx12 = x2 - x1,
    dy12 = y2 - y1;
    int32_t
    sa   = 0,
    sb   = 0;

    // For upper part of triangle, find scanline crossings for segments
    // 0-1 and 0-2.  If y1=y2 (flat-bottomed triangle), the scanline y1
    // is included here (and second loop will be skipped, avoiding a /0
    // error there), otherwise scanline y1 is skipped here and handled
    // in the second loop...which also avoids a /0 error here if y0=y1
    // (flat-topped triangle).
    if(y1 == y2) last = y1;   // Include y1 scanline
    else         last = y1-1; // Skip it

    for(y=y0; y<=last; y++) {
        a   = x0 + sa / dy01;
        b   = x0 + sb / dy02;
        sa += dx01;
        sb += dx02;
        /* longhand:
        a = x0 + (x1 - x0) * (y - y0) / (y1 - y0);
        b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
        */
        if(a > b) _swap_int16_t(a,b);
        MATRIX_DrawFastHLine(a, y, b-a+1, color);
    }

    // For lower part of triangle, find scanline crossings for segments
    // 0-2 and 1-2.  This loop is skipped if y1=y2.
    sa = (int32_t)dx12 * (y - y1);
    sb = (int32_t)dx02 * (y - y0);
    for(; y<=y2; y++) {
        a   = x1 + sa / dy12;
        b   = x0 + sb / dy02;
        sa += dx12;
        sb += dx02;
        /* longhand:
        a = x1 + (x2 - x1) * (y - y1) / (y2 - y1);
        b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
        */
        if(a > b) _swap_int16_t(a,b);
        MATRIX_DrawFastHLine(a, y, b-a+1, color);
    }
}

