thamkhanhdev/stm32_apps/H750_SDIO_MATRIX/Src/matrix.c
// TEXT- AND CHARACTER-HANDLING FUNCTIONS ----------------------------------

/**
 *  @brief   Draw a single character
 *
 *  @param    x   Bottom left corner x coordinate
 *  @param    y   Bottom left corner y coordinate
 *  @param    c   The 8-bit font-indexed character (likely ascii)
 *  @param    color 16-bit 5-6-5 Color to draw chraracter with
 *  @param    bg 16-bit 5-6-5 Color to fill background with (if same as color, no background)
 *  @param    size_x  Font magnification level in X-axis, 1 is 'original' size
 *  @param    size_y  Font magnification level in Y-axis, 1 is 'original' size
*/
void MATRIX_DrawChar( int16_t x, int16_t y, unsigned char c, uint16_t color, uint16_t bg, uint8_t size_x, uint8_t size_y, MATRIX_FontTypes fontType )
{
    if( FONT_DEFAULT == fontType )
    { // 'Classic' built-in font
    // if(1) { // 'Classic' built-in font

        if((x >= MATRIX_WIDTH)            || // Clip right
           (y >= MATRIX_HEIGHT)           || // Clip bottom
           ((x + 6 * size_x - 1) < 0) || // Clip left
           ((y + 8 * size_y - 1) < 0))   // Clip top
            return;

        if(!gCp437 && (c >= 176)) c++; // Handle 'classic' charset behavior
        MATRIX_FillRect(x, y, 5*size_x, 8*size_y, 0x0);
        for(int8_t i=0; i<5; i++ ) { // Char bitmap = 5 columns
            uint8_t line = pgm_read_byte(&font[c * 5 + i]);
            for(int8_t j=0; j<8; j++, line >>= 1) {
                if(line & 1) {
                    if(size_x == 1 && size_y == 1)
                        MATRIX_DrawPixel(x+i, y+j, color);
                    else
                        MATRIX_FillRect(x+i*size_x, y+j*size_y, size_x, size_y, color);
                } else if(bg != color) {
                    if(size_x == 1 && size_y == 1)
                        MATRIX_DrawPixel(x+i, y+j, bg);
                    else
                        MATRIX_FillRect(x+i*size_x, y+j*size_y, size_x, size_y, bg);
                }
            }
        }
        if(bg != color) { // If opaque, draw vertical line for last column
            if(size_x == 1 && size_y == 1) MATRIX_DrawFastVLine(x+5, y, 8, bg);
            else          MATRIX_FillRect(x+5*size_x, y, size_x, 8*size_y, bg);
        }

    } else { // Custom font

        // Character is assumed previously filtered by write() to eliminate
        // newlines, returns, non-printable characters, etc.  Calling
        // drawChar() directly with 'bad' characters of font may cause mayhem!

        c -= (uint8_t)pgm_read_byte(&gfxFont->first);
        GFXglyph *glyph  = pgm_read_glyph_ptr(gfxFont, c);
        uint8_t  *bitmap = pgm_read_bitmap_ptr(gfxFont);

        uint16_t bo = pgm_read_word(&glyph->bitmapOffset);
        uint8_t  w  = pgm_read_byte(&glyph->width),
                 h  = pgm_read_byte(&glyph->height);
        int8_t   xo = pgm_read_byte(&glyph->xOffset),
                 yo = pgm_read_byte(&glyph->yOffset);
        uint8_t  xx, yy, bits = 0, bit = 0;
        int16_t  xo16 = 0, yo16 = 0;

        if(size_x > 1 || size_y > 1) {
            xo16 = xo;
            yo16 = yo;
        }

        // Todo: Add character clipping here

        // NOTE: THERE IS NO 'BACKGROUND' COLOR OPTION ON CUSTOM FONTS.
        // THIS IS ON PURPOSE AND BY DESIGN.  The background color feature
        // has typically been used with the 'classic' font to overwrite old
        // screen contents with new data.  This ONLY works because the
        // characters are a uniform size; it's not a sensible thing to do with
        // proportionally-spaced fonts with glyphs of varying sizes (and that
        // may overlap).  To replace previously-drawn text when using a custom
        // font, use the getTextBounds() function to determine the smallest
        // rectangle encompassing a string, erase the area with fillRect(),
        // then draw new text.  This WILL infortunately 'blink' the text, but
        // is unavoidable.  Drawing 'background' pixels will NOT fix this,
        // only creates a new set of problems.  Have an idea to work around
        // this (a canvas object type for MCUs that can afford the RAM and
        // displays supporting setAddrWindow() and pushColors()), but haven't
        // implemented this yet.
        MATRIX_FillRect(x, y-h, w/2, h, 0x0);
        for(yy=0; yy<h; yy++) {
            for(xx=0; xx<w; xx++) {
                if(!(bit++ & 7)) {
                    bits = pgm_read_byte(&bitmap[bo++]);
                }
                if(bits & 0x80) {
                    if(size_x == 1 && size_y == 1) {
                        MATRIX_DrawPixel(x+xo+xx, y+yo+yy, color);
                    } else {
                        MATRIX_FillRect(x+(xo16+xx)*size_x, y+(yo16+yy)*size_y,
                          size_x, size_y, color);
                    }
                }
                bits <<= 1;
            }
        }

    } // End classic vs custom font
}

/**
 *  @brief  Print one byte/character of data, used to support print()
 *
 *  @param  c  The 8-bit ascii character to write
 */
size_t MATRIX_Write( uint8_t c, MATRIX_FontTypes fontType )
{
    if( FONT_DEFAULT == fontType ) // 'Classic' built-in font
    {
        if(c == '\n') {                        // Newline?
            gCursorX  = gBackupX;                     // Reset x to zero,
            gCursorY += gTextSizeY * 8;        // advance y one line
        } else if(c != '\r') {                 // Ignore carriage returns
            if(((gCursorX + gTextSizeX * 6) > MATRIX_WIDTH)) { // Off right?
                gCursorX  = gBackupX;                 // Reset x to zero,
                gCursorY += gTextSizeY * 8;    // advance y one line
            }
            MATRIX_DrawChar(gCursorX, gCursorY, c, gTextColor, gTextBgColor, gTextSizeX, gTextSizeY, fontType );
            gCursorX += gTextSizeX * 6;          // Advance x one char
        }
    } else
    {
        if(c == '\n') {
            gCursorX  = gBackupX;
            gCursorY += (int16_t)gTextSizeY *
                        (uint8_t)pgm_read_byte(&gfxFont->yAdvance);
        } else if(c != '\r') {
            uint8_t first = pgm_read_byte(&gfxFont->first);
            if((c >= first) && (c <= (uint8_t)pgm_read_byte(&gfxFont->last))) {
                GFXglyph *glyph  = pgm_read_glyph_ptr(gfxFont, c - first);
                uint8_t   w     = pgm_read_byte(&glyph->width),
                          h     = pgm_read_byte(&glyph->height);
                if((w > 0) && (h > 0)) { // Is there an associated bitmap?
                    int16_t xo = (int8_t)pgm_read_byte(&glyph->xOffset); // sic
                    if(((gCursorX + gTextSizeX * (xo + w)) > MATRIX_WIDTH)) {
                        gCursorX  = gBackupX;
                        gCursorY += (int16_t)gTextSizeY *
                          (uint8_t)pgm_read_byte(&gfxFont->yAdvance);
                        if( gCursorY > MATRIX_HEIGHT)
                        {
                            gCursorY = (int16_t)gTextSizeY *
                          (uint8_t)pgm_read_byte(&gfxFont->yAdvance);
                        }
                    }
                    MATRIX_DrawChar(gCursorX, gCursorY, c, gTextColor, gTextBgColor, gTextSizeX, gTextSizeY, fontType );
                }
                gCursorX += (uint8_t)pgm_read_byte(&glyph->xAdvance) * (int16_t)gTextSizeX;
            }
        }
    }
    return 1;
}

/**
 *  @brief   Set text 'magnification' size. Each increase in s makes 1 pixel that much bigger.
 *
 * @param  s  Desired text size. 1 is default 6x8, 2 is 12x16, 3 is 18x24, etc
 */
void MATRIX_SetTextSize( uint8_t s )
{
    gTextSizeX = (s > 0) ? s : 1;
    gTextSizeY = (s > 0) ? s : 1;
}

/**
 *   @brief      Set rotation setting for display
 *
 *   @param  x   0 thru 3 corresponding to 4 cardinal rotations
 */
void MATRIX_SetRotation( uint8_t x )
{
    (void) x;
    // switch(x & 3) {
    //     case 0:
    //     case 2:
    //         _width  = WIDTH;
    //         _height = HEIGHT;
    //         break;
    //     case 1:
    //     case 3:
    //         _width  = HEIGHT;
    //         _height = WIDTH;
    //         break;
    // }
}

void MATRIX_Print( uint8_t *s, MATRIX_FontTypes fontType )
{
    while (*s)
    {
        MATRIX_Write(*s++, fontType );
    }
}

void MATRIX_Printf( MATRIX_FontTypes fontType, char *fmt, ... )
{
    va_list argp;
    va_start(argp, fmt);
    MATRIX_Vprint( fontType, fmt, argp );
    va_end(argp);
}
/**
 *  @brief  Set text cursor location
 *
 *  @param  x    X coordinate in pixels
 *  @param  y    Y coordinate in pixels
 */
inline void MATRIX_SetCursor( int16_t x, int16_t y )
{
    gCursorX = x;
    gBackupX = x;

    gCursorY = y;
    gBackupY = y;
}

/**
 *  @brief   Set text font color with transparant background
 *
 *  @param   c   16-bit 5-6-5 Color to draw text with
 *  @note    For 'transparent' background, background and foreground
 *           are set to same color rather than using a separate flag.
 */
void MATRIX_SetTextColor( uint16_t c )
{
    gTextColor = gTextBgColor = c;
}

